snlkuharlocal/src/InformationRegisters/БезопасноеХранилищеДанных/БезопасноеХранилищеДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БезопасноеХранилищеДанных</name>
  <comment>// Ихсанов Д. А. 30.09.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2523</comment>
  <resources>
    <name>Данные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>CatalogRef.КлючиБезопасногоХранилищаДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипКлюча</name>
    <type>
      <types>EnumRef.ТипыКлючейБезопасногоХранилищаДанных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/CommonModules/РаботаСБезопаснымХранилищем/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//// Пример взаимодействия с безопасным хранилищем для внесения, редактирования и удаления данных авторизации
//
//КлючБезопасностиДанных = Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКСкладскойБазе;
//
//РаботаСБезопаснымХранилищем.ОчиститьДанныеАвторизацииПоКлючу(КлючБезопасностиДанных);
//
//РаботаСБезопаснымХранилищем.ВыполнитьОчисткуТиповКлюча(КлючБезопасностиДанных);
//
//РаботаСБезопаснымХранилищем.ВнестиТипКлючаВЭлементСправочника(КлючБезопасностиДанных, Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Логин);
//РаботаСБезопаснымХранилищем.ВнестиТипКлючаВЭлементСправочника(КлючБезопасностиДанных, Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Пароль);
//РаботаСБезопаснымХранилищем.ВнестиТипКлючаВЭлементСправочника(КлючБезопасностиДанных, Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Токен);
//
//РаботаСБезопаснымХранилищем.ОбновитьПараметрыАвторизацииПоКлючу(КлючБезопасностиДанных,
//	Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Логин, Логин);
//РаботаСБезопаснымХранилищем.ОбновитьПараметрыАвторизацииПоКлючу(КлючБезопасностиДанных,
//	Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Пароль, Пароль);
//РаботаСБезопаснымХранилищем.ОбновитьПараметрыАвторизацииПоКлючу(КлючБезопасностиДанных,
//	Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Токен, Токен);
//
//ДанныеАвторизации = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(КлючБезопасностиДанных);
//
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Записать данные авторизации по ключу
//
// Параметры:
//  Ключ						 - СправочникСсылка.КлючиБезопасногоХранилищаДанных	 - Ключ к данным авторизации
//  СтруктураДанныхАвторизации	 - Структура										 - Структура данных в формате:
//		Перечисления.ТипыКлючейБезопасногоХранилищаДанных.Токен - Строка (Данные авторизации)
// 
// Возвращаемое значение:
//  Булево - Истина при удачной инициализации, если бы ли ошибки - Ложь
//
Функция ЗаписатьДанныеАвторизацииПоКлючу(Ключ, СтруктураДанныхАвторизации) Экспорт
	
	Попытка
		ДанныеПоКлючуОчищены = ОчиститьДанныеАвторизацииПоКлючу(Ключ);
		Если Не ДанныеПоКлючуОчищены Тогда
			Возврат Ложь
		КонецЕсли;
		
		ТипыКлючаОчищены = ВыполнитьОчисткуТиповКлюча(Ключ);
		Если Не ТипыКлючаОчищены Тогда
			Возврат Ложь
		КонецЕсли;
		
		Для каждого ТипДанныхАвторизации из СтруктураДанныхАвторизации Цикл
			НовыйТипКлючаВнесен = ВнестиТипКлючаВЭлементСправочника(Ключ, ТипДанныхАвторизации.Ключ);
			Если Не НовыйТипКлючаВнесен Тогда
				Возврат Ложь
			КонецЕсли;
			
			ПараметрыАвторизацииОбновлены = ОбновитьПараметрыАвторизацииПоКлючу(Ключ, ТипДанныхАвторизации.Ключ, ТипДанныхАвторизации.Значение);
			Если Не ПараметрыАвторизацииОбновлены Тогда
				Возврат Ложь
			КонецЕсли;
		КонецЦикла
	Исключение
		СообщениеОбОшибке = СтрШаблон("Не удалось инициализировать ключ безопасности данных: %1.",
			Ключ);
		ЗаписатьВЛог("БезопасноеХранилище", СообщениеОбОшибке, "Ошибка", Истина);
		
		Возврат Ложь
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции

// Функция - Прочитать данные авторизации по ключу
//
// Параметры:
//  Ключ - СправочникСсылка.КлючиБезопасногоХранилищаДанных	 - Ключ к данным авторизации
// 
// Возвращаемое значение:
//  Структура - Все типы данных авторизации, указанные в ТЧ элемента
//
Функция ПрочитатьДанныеАвторизацииПоКлючу(Ключ) Экспорт
	
	МассивТиповКлючей = Ключ.ИспользуемыеТипыКлючей.ВыгрузитьКолонку("ТипКлюча");
	
	СтруктураДанныхАвторизации = Новый Структура;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПРЕДСТАВЛЕНИЕ(БезопасноеХранилищеДанных.ТипКлюча) КАК ТипКлюча,
	|	БезопасноеХранилищеДанных.Данные КАК Данные
	|ИЗ
	|	РегистрСведений.БезопасноеХранилищеДанных КАК БезопасноеХранилищеДанных
	|ГДЕ
	|	БезопасноеХранилищеДанных.Ключ = &Ключ
	|	И БезопасноеХранилищеДанных.ТипКлюча В(&ТипКлюча)");
	Запрос.УстановитьПараметр("Ключ", Ключ);
	Запрос.УстановитьПараметр("ТипКлюча", МассивТиповКлючей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураДанныхАвторизации.Вставить(Выборка.ТипКлюча, Выборка.Данные)
	КонецЦикла;
	
	Возврат СтруктураДанныхАвторизации
	
КонецФункции // ПрочитатьДанныеАвторизацииПоКлючу()

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция - Внести тип ключа в элемент справочника
//
// Параметры:
//  Ключ	 - СправочникСсылка.КлючиБезопасногоХранилищаДанных			 - Ключ к данным авторизации
//  ТимКлюча - ПеречислениеСсылка.ТипыКлючейБезопасногоХранилищаДанных	 - Тип ключа к данным авторизации
// 
// Возвращаемое значение:
//  Булево - Если запись элемента ключа прошла успешно, то возвращается Истина, иначе Ложь
//
Функция ВнестиТипКлючаВЭлементСправочника(Ключ, ТипКлюча) Экспорт
	
	СправочникОбъектКлючиБезопасногоХранилищаДанных = Ключ.ПолучитьОбъект();
	
	НоваяСтрока = СправочникОбъектКлючиБезопасногоХранилищаДанных.ИспользуемыеТипыКлючей.Добавить();
	НоваяСтрока.ТипКлюча = ТипКлюча;
	
	Попытка
		СправочникОбъектКлючиБезопасногоХранилищаДанных.Записать()
	Исключение
		СообщениеОбОшибке = СтрШаблон("Не удалось добавить тип в ключ безопасности данных: %1. Тип: %2",
			Ключ, ТипКлюча);
		ЗаписатьВЛог("БезопасноеХранилище", СообщениеОбОшибке, "Ошибка", Истина);
		
		Возврат Ложь
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции // ВнестиТипКлючаВЭлементСправочника()

// Функция - Обновить параметры авторизации по ключу
//
// Параметры:
//  Ключ	 - СправочникСсылка.КлючиБезопасногоХранилищаДанных			 - Ключ к данным авторизации
//  ТипКлюча - ПеречислениеСсылка.ТипыКлючейБезопасногоХранилищаДанных	 - Тип ключа к данным авторизации
//  Данные	 - Строка													 - Данные авторизации
// 
// Возвращаемое значение:
//  Булево - Если запись новых параметров прошла успешно, то возвращается Истина, иначе Ложь
//
Функция ОбновитьПараметрыАвторизацииПоКлючу(Ключ, ТипКлюча, Данные) Экспорт
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКлюча", ТипКлюча);
	
	НайденныеСтроки = Ключ.ИспользуемыеТипыКлючей.НайтиСтроки(ПараметрыОтбора);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Ложь
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.БезопасноеХранилищеДанных.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ключ = Ключ;
	МенеджерЗаписи.ТипКлюча = ТипКлюча;
	МенеджерЗаписи.Данные = Данные;
	
	Попытка
		МенеджерЗаписи.Записать(Истина);
	Исключение
		СообщениеОбОшибке = СтрШаблон("Не удалось обновить параметры авторизации по ключу: %1. Тип: %2",
			Ключ, ТипКлюча);
		ЗаписатьВЛог("БезопасноеХранилище", СообщениеОбОшибке, "Ошибка", Истина);
		
		Возврат Ложь
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции // ОбновитьПараметрыАутентификацииПоКлючу()

// Функция - Выполнить очистку типов ключа
//
// Параметры:
//  Ключ	 - СправочникСсылка.КлючиБезопасногоХранилищаДанных	 - Ключ к данным авторизации
// 
// Возвращаемое значение:
//  Булево - Если запись новых параметров прошла успешно, то возвращается Истина, иначе Ложь
//
Функция ВыполнитьОчисткуТиповКлюча(Ключ) Экспорт
	
	СправочникОбъектКлючиБезопасногоХранилищаДанных = Ключ.ПолучитьОбъект();
	СправочникОбъектКлючиБезопасногоХранилищаДанных.ИспользуемыеТипыКлючей.Очистить();
	
	Попытка
		СправочникОбъектКлючиБезопасногоХранилищаДанных.Записать()
	Исключение
		СообщениеОбОшибке = СтрШаблон("Не удалось выполнить очистку типов ключа: %1", Ключ);
		ЗаписатьВЛог("БезопасноеХранилище", СообщениеОбОшибке, "Ошибка", Истина);
		
		Возврат Ложь
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции // ВыполнитьОчисткуТиповКлюча()

// Функция - Очистить данные авторизации по ключу
//
// Параметры:
//  Ключ	 - СправочникСсылка.КлючиБезопасногоХранилищаДанных	 - Ключ к данным авторизации
// 
// Возвращаемое значение:
//  Булево - Если запись новых параметров прошла успешно, то возвращается Истина, иначе Ложь
//
Функция ОчиститьДанныеАвторизацииПоКлючу(Ключ) Экспорт
	
	НаборЗаписей = РегистрыСведений.БезопасноеХранилищеДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Ключ.Установить(Ключ);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Попытка
		НаборЗаписей.Записать()
	Исключение
		СообщениеОбОшибке = СтрШаблон("Не удалось очистить данные авторизации по ключу: %1", Ключ);
		ЗаписатьВЛог("БезопасноеХранилище", СообщениеОбОшибке, "Ошибка", Истина);
		
		Возврат Ложь
	КонецПопытки;
	
	Возврат Истина
	
КонецФункции // ОчиститьДанныеАвторизацииПоКлючу()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
